12/data/attachments/b9e8662a8df88db0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_087ae82e-0f29-415c-8b0e-bfe8c0eedb26</nif:username>
            <nif:friendToBeAdded>William_report_Actions_36884_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>